[
  {
    "id": 1,
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/5/51/Facebook_f_logo_%282019%29.svg",
    "description": "Facebook serves as the foundational global social networking platform, enabling billions of users to connect with friends, family, and colleagues through a highly interactive interface. Users rely on the platform to share personal updates, post photos, and upload videos to a dynamic News Feed that keeps them informed about their social circles and the wider world. Beyond personal connections, Facebook is a vital hub for community engagement, supporting large interest-based groups, facilitating communication with businesses via Pages, and offering utility tools like event organization and the Marketplace for buying and selling goods locally, making it a comprehensive digital ecosystem for daily life.",
    "size": 78,
    "reviews": "140M",
    "ratingAvg": 4.1,
    "downloads": 5000,
    "ratings": [
      { "name": "1 star", "count": 10000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": "15000000" },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 85000000 }
    ]
  },
  {
    "id": 2,
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Instagram_icon.png",
    "description": "Instagram is the premier visual social media platform, prioritizing high-quality photos and video content, including long-form video, short vertical videos (Reels), and ephemeral content via Stories. It functions as a global gallery and discovery engine, allowing users to express creativity using advanced editing tools, filters, and AR effects. The app fosters community through direct messaging, live video, and a personalized Explore page that introduces trending content, new creators, and businesses. It's an indispensable tool for influencers, brands, and artists to build visual narratives and engage with a massive, style-conscious audience.",
    "size": 65,
    "reviews": "150M",
    "ratingAvg": 4.3,
    "downloads": 5000,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": "16000000" },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 100000000 }
    ]
  },
  {
    "id": 3,
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "description": "WhatsApp is a secure, cross-platform instant messaging application utilized by billions for private, reliable communication across the globe. The service distinguishes itself by offering end-to-end encryption by default for all text messages, voice calls, and video calls, ensuring only the sender and receiver can access the content. Users leverage WhatsApp to create secure group chats, share media files, documents, and contacts, and utilize the 'Status' feature for ephemeral updates. Crucially, it only requires a phone number to register and relies solely on an internet connection, making it an accessible and widely adopted primary communication tool across various mobile operating systems.",
    "size": 42,
    "reviews": "185M",
    "ratingAvg": 4.4,
    "downloads": 5000,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": "6000000" },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 150000000 }
    ]
  },
  {
    "id": 4,
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "image": "https://upload.wikimedia.org/wikipedia/en/a/a9/TikTok_logo.svg",
    "description": "TikTok revolutionized mobile video by focusing on short-form, creative, and spontaneous clips, driven by an exceptionally powerful 'For You' algorithm that customizes the content stream for every user. The app empowers creators with intuitive video editing tools, vast music libraries, and special effects, enabling anyone to achieve virality. It has become the epicenter of global trends in music, dance, comedy, and emerging cultural phenomena, moving far beyond mere entertainment to influence everything from consumer products to political discussion. Its unique strength lies in democratizing content creation and prioritizing instant, engaging discovery.",
    "size": 85,
    "reviews": "45M",
    "ratingAvg": 4.4,
    "downloads": 1000,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": "2000000" },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 30000000 }
    ]
  },
  {
    "id": 5,
    "title": "X",
    "companyName": "X Corp.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/c/ce/X_logo_2023.svg",
    "description": "X, formerly known as Twitter, is a real-time information network and microblogging service dedicated to the rapid sharing and consumption of short text posts, or 'X's. It operates at the intersection of social networking and journalism, often serving as the first platform to break news, drive political discourse, and host live public commentary on global events. Users engage by posting, reposting, commenting, and utilizing trending hashtags to participate in massive conversations. The app’s strength is its immediacy and ability to aggregate diverse opinions and updates on any given topic, making it a vital pulse point for current affairs and cultural movements.",
    "size": 92,
    "reviews": "20M",
    "ratingAvg": 4.2,
    "downloads": 1000,
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": "2500000" },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "id": 6,
    "title": "Messenger",
    "companyName": "Meta Platforms, Inc.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/b/be/Facebook_Messenger_logo_2020.svg",
    "description": "Messenger is Meta's robust, dedicated platform for private communication, allowing seamless text, audio, and high-definition video conversations. Fully integrated with Facebook, it supports both one-on-one and large group chats, enabling users to stay connected with their entire network. The application extends simple messaging functionality with rich features like sending money, sharing location, engaging with customizable emojis and GIFs, and utilizing fun, interactive effects. It also includes advanced privacy options, such as 'Vanish Mode' for disappearing messages, making it a comprehensive tool for expressive and spontaneous digital interactions.",
    "size": 58,
    "reviews": "80M",
    "ratingAvg": 4.0,
    "downloads": 5000,
    "ratings": [
      { "name": "1 star", "count": 6000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": "10000000" },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 40000000 }
    ]
  },
  {
    "id": 7,
    "title": "Snapchat",
    "companyName": "Snap Inc",
    "image": "https://upload.wikimedia.org/wikipedia/en/c/c4/Snapchat_logo.svg",
    "description": "Snapchat is a multimedia messaging app built fundamentally around the idea of ephemeral content, where shared photos and videos—known as 'Snaps'—are typically short-lived. It popularized the vertical video format and the 'Stories' feature for compiling daily moments. The app is most famous for its constantly evolving library of innovative Augmented Reality (AR) Lenses, or filters, which overlay dynamic effects onto faces and the real world. Additionally, it offers a Discover page for curated media content and a 'Snap Map' for sharing real-time location with friends, prioritizing fast, spontaneous, and fun communication over permanent posts.",
    "size": 75,
    "reviews": "30M",
    "ratingAvg": 4.1,
    "downloads": 1000,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": "4000000" },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 15000000 }
    ]
  },
  {
    "id": 8,
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/82/Telegram_logo.svg",
    "description": "Telegram is a cloud-based, cross-platform instant messaging service distinguished by its powerful focus on speed, robust security, and the capacity for large-scale communities. Unlike many competitors, Telegram offers end-to-end encrypted 'Secret Chats' for maximum privacy and supports massive groups and public broadcast channels, some with up to 200,000 members. Its reliance on cloud storage ensures message history is instantly synchronized across all user devices simultaneously. This makes it a favored tool for activists, large organizations, and users who require high-volume, secure communication and reliable file sharing without size limits.",
    "size": 62,
    "reviews": "15M",
    "ratingAvg": 4.4,
    "downloads": 1000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": "1000000" },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "id": 9,
    "title": "YouTube",
    "companyName": "Google LLC",
    "image": "https://upload.wikimedia.org/wikipedia/commons/b/b8/YouTube_Logo_2017.svg",
    "description": "YouTube is the world's preeminent platform for video content, hosting an unimaginable volume of material ranging from professional productions to user-generated vlogs, educational tutorials, and live streams. It serves as both a massive entertainment hub and a critical search engine, with personalized recommendations guiding billions of users to the most relevant content across music, gaming, news, and more. The platform offers sophisticated tools for creators to upload, edit, monetize, and interact with their global audience through comments and community features. Its influence on media consumption, cultural trends, and digital learning is unparalleled.",
    "size": 80,
    "reviews": "150M",
    "ratingAvg": 4.2,
    "downloads": 10000,
    "ratings": [
      { "name": "1 star", "count": 10000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": "15000000" },
      { "name": "4 star", "count": 30000000 },
      { "name": "5 star", "count": 90000000 }
    ]
  },
  {
    "id": 10,
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/08/Netflix_2015_logo.svg",
    "description": "Netflix is the dominant subscription video-on-demand (SVOD) service globally, offering a vast, continuously updated library of licensed and original content. Its business model centers on binge-watching, high-production original programming (known as 'Netflix Originals'), and highly accurate personalization algorithms that recommend content based on viewing history. The app supports multiple user profiles per account, offers offline downloading for mobile viewing, and streams in high definition, completely redefining how consumers access and enjoy TV series, films, and documentaries, moving away from traditional broadcast schedules.",
    "size": 70,
    "reviews": "15M",
    "ratingAvg": 4.3,
    "downloads": 1000,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": "1500000" },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 9000000 }
    ]
  },
  {
    "id": 11,
    "title": "Spotify",
    "companyName": "Spotify AB",
    "image": "https://upload.wikimedia.org/wikipedia/commons/2/26/Spotify_logo_with_text.svg",
    "description": "Spotify is the world’s most popular music, podcast, and video streaming service, providing instant access to tens of millions of tracks and episodes from creators worldwide. It operates on a freemium model, offering both an ad-supported free tier and a premium subscription for ad-free listening and offline downloads. Its key strength lies in its powerful personalization algorithms, which create genre-specific and mood-based playlists, alongside famous auto-generated playlists like 'Discover Weekly,' making it the leading platform for both consuming established music and discovering new artists and audio content.",
    "size": 60,
    "reviews": "30M",
    "ratingAvg": 4.4,
    "downloads": 1000,
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": "2500000" },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 20000000 }
    ]
  },
  {
    "id": 12,
    "title": "Gmail",
    "companyName": "Google LLC",
    "image": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Gmail_icon_%282020%29.svg",
    "description": "Gmail is Google's highly efficient and widely used email service, known for its clean interface, generous storage, and industry-leading spam filtering capabilities. The mobile app provides instant push notifications and allows users to read and compose emails both online and offline. Key productivity features include 'Smart Compose' for predictive text, automated categorization of incoming mail into tabs (Primary, Social, Promotions), and deep integration with the wider Google ecosystem (Drive, Calendar, Meet), ensuring seamless workflow management and secure communication for personal and business users.",
    "size": 50,
    "reviews": "10M",
    "ratingAvg": 4.3,
    "downloads": 10000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": "1000000" },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 5500000 }
    ]
  },
  {
    "id": 13,
    "title": "Google Photos",
    "companyName": "Google LLC",
    "image": "https://upload.wikimedia.org/wikipedia/commons/1/12/Google_Photos_icon_%282020%29.svg",
    "description": "Google Photos acts as a sophisticated, cloud-based home for a user's entire library of photos and videos, offering automatic, secure backup across all devices. The application's core feature is its use of powerful machine learning to automatically organize media, enabling users to effortlessly search for specific images using keywords like 'beach,' 'dog,' or 'Paris,' without requiring manual tagging. It enhances memories by automatically creating collages, animated GIFs, and stylized photos. Furthermore, it provides simple, yet effective, editing tools and easy sharing options, making it an essential service for managing and celebrating digital memories.",
    "size": 95,
    "reviews": "15M",
    "ratingAvg": 4.5,
    "downloads": 5000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": "1000000" },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "id": 14,
    "title": "Discord",
    "companyName": "Discord Inc.",
    "image": "https://upload.wikimedia.org/wikipedia/en/9/98/Discord_logo.svg",
    "description": "Discord is a versatile voice, video, and text communication platform initially designed to facilitate interactions within gaming communities, but now widely adopted by various clubs, educational groups, and professional teams. The platform is organized into 'servers,' which are customized hubs featuring themed channels where members can gather, hang out, and collaborate. It excels with low-latency voice chat features, integrated screen sharing, and highly granular administrative controls over member roles and permissions. This flexibility allows Discord to serve as a comprehensive, always-on space for real-time social interaction and organized community building.",
    "size": 120,
    "reviews": "10M",
    "ratingAvg": 4.4,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": "1000000" },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 5500000 }
    ]
  },
  {
    "id": 15,
    "title": "Pinterest",
    "companyName": "Pinterest",
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/08/Pinterest-logo.png",
    "description": "Pinterest functions as a unique visual discovery engine, helping users find inspiration, ideas, and actionable advice across an enormous range of interests, from DIY crafts and fashion to complex home renovations and travel planning. Users save captivating images or videos, called 'Pins,' to custom-titled 'boards,' effectively creating a digital mood board or visual plan for future projects and lifestyle goals. The app is highly intuitive for visual browsing and drives significant referral traffic to blogs and e-commerce sites, positioning itself not merely as a social network, but as an essential personal curation and planning tool.",
    "size": 75,
    "reviews": "12M",
    "ratingAvg": 4.5,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": "1000000" },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 8000000 }
    ]
  },
  {
    "id": 16,
    "title": "Zoom",
    "companyName": "Zoom Video Communications, Inc.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Zoom_Communications_Logo.svg",
    "description": "Zoom is the industry-leading, cloud-based platform for unified video conferencing, characterized by its remarkable stability, high-definition audio, and intuitive user experience. It became essential for remote work, education, and social gatherings globally, enabling seamless virtual meetings and webinars. Core features include robust screen sharing, customizable virtual backgrounds, instant chat, and powerful collaboration tools like whiteboarding and meeting recording, ensuring effective, large-scale digital communication across various devices and network conditions.",
    "size": 120,
    "reviews": "8M",
    "ratingAvg": 4.3,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": "500000" },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 5500000 }
    ]
  },
  {
    "id": 17,
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "image": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Amazon_icon.svg",
    "description": "The official Amazon Shopping application offers a convenient, highly optimized mobile experience for browsing, searching, and purchasing products from the world's most extensive online retailer. It incorporates key e-commerce functionalities, such as access to millions of product details, user-submitted reviews, and personalized product recommendations based on search history. The app significantly enhances the customer journey with essential features like real-time, detailed package tracking, multiple secure payment options, and innovative mobile tools like image-based product search and augmented reality views to visualize items in the user's space.",
    "size": 85,
    "reviews": "10M",
    "ratingAvg": 4.2,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": "800000" },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 5500000 }
    ]
  },
  {
    "id": 18,
    "title": "LinkedIn",
    "companyName": "LinkedIn",
    "image": "https://upload.wikimedia.org/wikipedia/commons/c/ca/LinkedIn_logo_initials.png",
    "description": "LinkedIn is the world's largest professional networking platform, serving as the definitive global resource for career development, job searching, and business intelligence. Users build comprehensive professional profiles that act as dynamic digital resumes, showcasing their experience, skills, and endorsements. The platform is crucial for networking, enabling professionals to connect with colleagues and industry leaders, follow corporate news and trends, and directly apply for millions of job listings. It is an indispensable tool for career management, professional learning, and establishing a reputable presence in the global workforce.",
    "size": 80,
    "reviews": "8M",
    "ratingAvg": 4.3,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": "500000" },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 5000000 }
    ]
  },
  {
    "id": 19,
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Google_Chrome_icon_%28September_2014%29.svg",
    "description": "Google Chrome is a fast, highly secure, and universally popular web browser, specifically optimized for speed and functionality on mobile devices. For Android users, the app integrates essential features like seamless synchronization of browsing data, bookmarks, and open tabs across all user devices. It enhances security with 'Safe Browsing' alerts against malicious sites and boosts efficiency with built-in tools like Google Translate. Furthermore, it offers customizable homepages with personalized news articles and a data saver mode, ensuring a protected, efficient, and consistent browsing experience across the internet.",
    "size": 90,
    "reviews": "25M",
    "ratingAvg": 4.1,
    "downloads": 10000,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": "3000000" },
      { "name": "4 star", "count": 6500000 },
      { "name": "5 star", "count": 12000000 }
    ]
  },
  {
    "id": 20,
    "title": "Among Us",
    "companyName": "InnerSloth",
    "image": "https://upload.wikimedia.org/wikipedia/en/9/9a/Among_Us_cover_art.jpg",
    "description": "Among Us is a phenomenally popular online multiplayer social deduction game set in a space-themed environment, where 4 to 15 players work together to complete tasks on a spaceship or planetary base. The central conflict involves a group of 'Crewmates' trying to identify the hidden 'Impostors' among them, who are actively sabotaging the mission and killing the crew. The core gameplay loop involves emergency meetings, where players must use social deduction, voting, and persuasion to root out the liar. Its simple, accessible design, combined with its high-stakes social dynamics, fueled its widespread viral success and enduring popularity as a party game.",
    "size": 120,
    "reviews": "70M",
    "ratingAvg": 4.4,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": "7000000" },
      { "name": "4 star", "count": 14000000 },
      { "name": "5 star", "count": 40000000 }
    ]
  }
]