[
  {
    "id": 1,
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/5/51/Facebook_f_logo_%282019%29.svg",
    "description": "Keeping up with friends is faster and easier than ever. Share updates and photos, engage with friends and Pages, and stay connected to communities important to you.\n\nConnect with friends, family and people who share the same interests as you. Communicate privately, watch your favorite content, buy and sell items or just spend time with your community. On Facebook, it's easy to keep up with the people who matter most.",
    "size": 78,
    "reviews": "140M",
    "ratingAvg": 4.1,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 220000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 900000 }
    ]
  },
  {
    "id": 2,
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Instagram_icon.png",
    "description": "Bringing you closer to the people and things you love. Connect with friends, share what you're up to, or see what's new from others all over the world. Explore our community where you can feel free to be yourself and share everything from your daily moments to life's highlights.\n\nExpress Yourself and Connect With Friends. Add photos and videos to your story that disappear after 24 hours, and bring them to life with fun creative tools. Message your friends in Direct. Start fun conversations about what you see on Feed and Stories.",
    "size": 65,
    "reviews": "150M",
    "ratingAvg": 4.3,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 36000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 40000 },
      { "name": "5 star", "count": 240000 }
    ]
  },
  {
    "id": 3,
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "description": "A simple, secure, and reliable private messaging and calling app, available on phones all over the world. Your personal messages and calls to friends and family are end-to-end encrypted. No one outside of your chats, not even WhatsApp, can read or listen to them.\n\nSimple and secure messaging, right away. All you need is your phone number, no user names or logins. You can quickly view your contacts who are on WhatsApp and start messaging. Enjoy group chats with your contacts so you can easily stay in touch with your friends and family.",
    "size": 42,
    "reviews": "185M",
    "ratingAvg": 4.2,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 135000 }
    ]
  },
  {
    "id": 4,
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "image": "https://upload.wikimedia.org/wikipedia/en/a/a9/TikTok_logo.svg",
    "description": "The destination for mobile videos. On TikTok, short-form videos are exciting, spontaneous, and genuine. Whether you’re a sports fanatic, a pet enthusiast, or just looking for a laugh, there’s something for everyone on TikTok. All you have to do is watch, engage with what you like, skip what you don’t, and you’ll find an endless stream of short videos that feel personalized just for you.\n\nWe make it easy for you to discover and create your own original videos by providing easy-to-use tools to view and capture your daily moments. Take your videos to the next level with special effects, filters, music, and more.",
    "size": 85,
    "reviews": "45M",
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 26000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 40000 },
      { "name": "5 star", "count": 320000 }
    ]
  },
  {
    "id": 5,
    "title": "X",
    "companyName": "X Corp.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/c/ce/X_logo_2023.svg",
    "description": "The go-to social media app for what's happening. From breaking news and entertainment to sports and politics, get the full story with all the live commentary. Join the conversation and see what people are talking about now.\n\nDiscover what's trending in your area and around the world. Stay informed with real-time updates from news outlets, journalists, and public figures. Go live with video, share your thoughts, and follow topics you're interested in to get the latest scoop.",
    "size": 92,
    "reviews": "20M",
    "ratingAvg": 4.2,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 7000 },
      { "name": "3 star", "count": 10000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 100000 }
    ]
  },
  {
    "id": 6,
    "title": "Messenger",
    "companyName": "Meta Platforms, Inc.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/b/be/Facebook_Messenger_logo_2020.svg",
    "description": "Be together whenever, with a simple way to text, video chat and rally the group. Send photos and videos, express yourself with stickers, GIFs and emojis. Watch videos, movies, and TV shows with your friends over video chat.\n\nConnect with your favorite businesses to find deals, make reservations, and get customer support. Capture every moment and react in real time with fun camera effects and filters. No phone numbers needed, just send a message to your Facebook friends.",
    "size": 58,
    "reviews": "80M",
    "ratingAvg": 4.0,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 150000 }
    ]
  },
  {
    "id": 7,
    "title": "Snapchat",
    "companyName": "Snap Inc",
    "image": "https://upload.wikimedia.org/wikipedia/en/c/c4/Snapchat_logo.svg",
    "description": "Share the moment! A fast and fun way to share moments with your friends and family. Snapchat opens right to the Camera, so you can send a Snap in seconds! Express yourself with Lenses, Filters, and Bitmoji.\n\nChat with friends, view their Stories, and explore news in Discover. Stay in touch with friends through live messaging, or share your day with Group Stories. See where your friends are hanging out, if they’ve shared their location with you on the Snap Map.",
    "size": 75,
    "reviews": "30M",
    "ratingAvg": 4.2,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 18000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 10000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 120000 }
    ]
  },
  {
    "id": 8,
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/82/Telegram_logo.svg",
    "description": "A messaging app with a focus on speed and security, it’s super-fast, simple and free. You can use Telegram on all your devices at the same time — your messages sync seamlessly across any number of your phones, tablets or computers.\n\nWith Telegram, you can send messages, photos, videos and files of any type (doc, zip, mp3, etc), as well as create groups for up to 200,000 people or channels for broadcasting to unlimited audiences. Everything on Telegram, including chats, groups, media, etc. is encrypted using a combination of 256-bit symmetric AES encryption, 2048-bit RSA encryption, and Diffie–Hellman secure key exchange.",
    "size": 62,
    "reviews": "15M",
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 7000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 70000 }
    ]
  }
]